zahidul3/athan-clock/BOOSTXL-K350QVG-S1_GrlibExample_MSP432P401R/main.c
        while(touch_detectedTouch())
        {
            ;
        }
        //printDebugString("\n\r");

        //SendUARTCmd('A');
        //touch_updateCurrentTouch(&g_sTouchContext);

//        if(g_ranDemo == true)
//        {
//            g_ranDemo = false;
//            drawMainMenu();
//        }

//        if( g_sTouchContext.touch)
//        {
//            if(Graphics_isImageButtonSelected(&primitiveButton, g_sTouchContext.x,  g_sTouchContext.y)){
//                Graphics_drawSelectedImageButton(&g_sContext,&primitiveButton);
//                runPrimitivesDemo();
//            }else if (Graphics_isImageButtonSelected(&imageButton, g_sTouchContext.x,  g_sTouchContext.y)){
//                Graphics_drawSelectedImageButton(&g_sContext,&imageButton);
//                runImagesDemo();
//            }
//
//            if(g_ranDemo == true)
//            {
//                g_ranDemo = false;
//                drawMainMenu();
//            }
//        }
    }

}

void initializeDemoButtons(void)
{
    // Initiliaze primitives Demo Button
    primitiveButton.xPosition=20;
    primitiveButton.yPosition=50;
    primitiveButton.borderWidth=5;
    primitiveButton.selected=false;
    primitiveButton.imageWidth=Primitives_Button4BPP_UNCOMP.xSize;
    primitiveButton.imageHeight=Primitives_Button4BPP_UNCOMP.ySize;
    primitiveButton.borderColor=GRAPHICS_COLOR_WHITE;
    primitiveButton.selectedColor=GRAPHICS_COLOR_RED;
    primitiveButton.image=&Primitives_Button4BPP_UNCOMP;


    // Initiliaze images Demo Button
    imageButton.xPosition=180;
    imageButton.yPosition=50;
    imageButton.borderWidth=5;
    imageButton.selected=false;
    imageButton.imageWidth=Primitives_Button4BPP_UNCOMP.xSize;
    imageButton.imageHeight=Primitives_Button4BPP_UNCOMP.ySize;
    imageButton.borderColor=GRAPHICS_COLOR_WHITE;
    imageButton.selectedColor=GRAPHICS_COLOR_RED;
    imageButton.image=&Images_Button4BPP_UNCOMP;

    yesButton.xMin = 80;
    yesButton.xMax = 150;
    yesButton.yMin = 80;
    yesButton.yMax = 120;
    yesButton.borderWidth = 1;
    yesButton.selected = false;
    yesButton.fillColor = GRAPHICS_COLOR_RED;
    yesButton.borderColor = GRAPHICS_COLOR_RED;
    yesButton.selectedColor = GRAPHICS_COLOR_BLACK;
    yesButton.textColor = GRAPHICS_COLOR_BLACK;
    yesButton.selectedTextColor = GRAPHICS_COLOR_RED;
    yesButton.textXPos = 100;
    yesButton.textYPos = 90;
    yesButton.text = "YES";
    yesButton.font = &g_sFontCm18;

    noButton.xMin = 180;
    noButton.xMax = 250;
    noButton.yMin = 80;
    noButton.yMax = 120;
    noButton.borderWidth = 1;
    noButton.selected = false;
    noButton.fillColor = GRAPHICS_COLOR_RED;
    noButton.borderColor = GRAPHICS_COLOR_RED;
    noButton.selectedColor = GRAPHICS_COLOR_BLACK;
    noButton.textColor = GRAPHICS_COLOR_BLACK;
    noButton.selectedTextColor = GRAPHICS_COLOR_RED;
    noButton.textXPos = 200;
    noButton.textYPos = 90;
    noButton.text = "NO";
    noButton.font = &g_sFontCm18;
}

//Draws TIME at bottom of screen
void drawTimeMenu(void)
{
    char buffer[NAMAZ_TIME_SIZE];

    Graphics_setForegroundColor(&g_sContext, GRAPHICS_COLOR_BLUE);
    Graphics_drawString(&g_sContext, "TIME", sizeof("TIME"), 3, NAMAZ_START_POS+NAMAZ_SPACING*6, TRANSPARENT_TEXT);

    Graphics_setForegroundColor(&g_sContext, GRAPHICS_COLOR_RED);
    sprintf(buffer,"%02d:%02d", CurrentHour, CurrentMinute);
    Graphics_drawString(&g_sContext, buffer, NAMAZ_TIME_SIZE, NAMAZ_TIME_START_POS_X, NAMAZ_START_POS+NAMAZ_SPACING*6, TRANSPARENT_TEXT);
}

void drawDateTimeMenu(void)
{
    char buffer[NAMAZ_TIME_SIZE];

    LcdScreen = DATE_SCREEN;
    printDebugString("Drawing Date Time Menu\n\r");

    Graphics_setForegroundColor(&g_sContext, GRAPHICS_COLOR_BLUE);
    Graphics_setBackgroundColor(&g_sContext, GRAPHICS_COLOR_BLACK);
    Graphics_clearDisplay(&g_sContext);
    Graphics_drawString(&g_sContext, "Date Times", sizeof("Date Times"), 3, 3, TRANSPARENT_TEXT);

    //Graphics_drawString(&g_sContext, (void *)&constDaysMonthsConfig.months[currentDateTime.Month-1], 3, 3, NAMAZ_START_POS+NAMAZ_SPACING*0, TRANSPARENT_TEXT);
    sprintf(buffer,"%02d-%02d-%02d", currentDateTime.Month, currentDateTime.Day, currentDateTime.Year);
    Graphics_setForegroundColor(&g_sContext, GRAPHICS_COLOR_RED);
    Graphics_drawString(&g_sContext, buffer, 8, 3, NAMAZ_START_POS+NAMAZ_SPACING*0, TRANSPARENT_TEXT);
}

void drawMainMenu(void)
{
    char buffer[NAMAZ_TIME_SIZE*2];

    LcdScreen = MAIN_SCREEN;
    printDebugString("Drawing Main Menu\n\r");

    Graphics_setForegroundColor(&g_sContext, GRAPHICS_COLOR_BLUE);
    Graphics_setBackgroundColor(&g_sContext, GRAPHICS_COLOR_BLACK);
    Graphics_clearDisplay(&g_sContext);
    Graphics_drawString(&g_sContext, "Athan Times", sizeof("Athan Times"), 3, 3, TRANSPARENT_TEXT);

    // Draw TI banner at the bottom of screnn
//    Graphics_drawImage(&g_sContext,
//        &TI_platform_bar_red4BPP_UNCOMP,
//        0,
//        Graphics_getDisplayHeight(&g_sContext) - TI_platform_bar_red4BPP_UNCOMP.ySize);

    Graphics_setForegroundColor(&g_sContext, athanDescColor[0]);
    Graphics_drawString(&g_sContext, "Fajr", sizeof("Fajr"), 3, NAMAZ_START_POS+NAMAZ_SPACING*0, TRANSPARENT_TEXT);
    Graphics_setForegroundColor(&g_sContext, athanDescColor[1]);
    Graphics_drawString(&g_sContext, "Sunrise", sizeof("Sunrise"), 3, NAMAZ_START_POS+NAMAZ_SPACING*1, TRANSPARENT_TEXT);
    Graphics_setForegroundColor(&g_sContext, athanDescColor[2]);
    Graphics_drawString(&g_sContext, "Dhuhr", sizeof("Dhuhr"), 3, NAMAZ_START_POS+NAMAZ_SPACING*2, TRANSPARENT_TEXT);
    Graphics_setForegroundColor(&g_sContext, athanDescColor[3]);
    Graphics_drawString(&g_sContext, "Asr", sizeof("Asr"), 3, NAMAZ_START_POS+NAMAZ_SPACING*3, TRANSPARENT_TEXT);
    Graphics_setForegroundColor(&g_sContext, athanDescColor[4]);
    Graphics_drawString(&g_sContext, "Maghrib", sizeof("Maghrib"), 3, NAMAZ_START_POS+NAMAZ_SPACING*4, TRANSPARENT_TEXT);
    Graphics_setForegroundColor(&g_sContext, athanDescColor[5]);
    Graphics_drawString(&g_sContext, "Isha", sizeof("Isha"), 3, NAMAZ_START_POS+NAMAZ_SPACING*5, TRANSPARENT_TEXT);

